{
  "announcements": [
    {
      "id": "everdew-v0.4.1",
      "title": "Everdew",
      "date": "2026-02-16",
      "tag": "New Update",
      "body": [
        "Everdew — Version 0.4.1 Update!",
        "Time & Save Fixes",
        "- Fixed an issue where the save and load system didn't accurately save the time of day",
        "- Fixed the day/night cycle so the day counter properly advances at midnight (12:00 AM) instead of sunrise",
        "- Fixed an issue where day/night lighting would slowly fade in when loading a save. The environment now instantly snaps to the correct time of day",
        "- Fixed an issue where time passed at inconsistent speeds during the day and night. The in-game clock now progresses at a steady, consistent rate through all daily phases",
        "- Fixed a bug where shop inventory would incorrectly reset to full stock when loading a saved game. Seed quantities now persist correctly between sessions",
        "- Turned off the Raycast for the fade out image so button clicks can be clickable during load",
        "- Removed some of the lights in the scene that turns on at night"
      ]
    },
    {
      "id": "cubo-v0.2.7",
      "title": "Cubo",
      "date": "2026-02-12",
      "tag": "New Update",
      "body": [
        "Cubo — Version 0.2.7 Update!",
        "Gameplay Improvements & Arena Update",
        "- Reworked the \"Grump Rock\" Arena with layout improvements and gameplay adjustments",
        "- Added a Speedrun Timer toggle in the Options menu",
        "- The game now tracks total player deaths and displays them on the end screen",
        "- Moved a Cooler inside the \"Grump Rock\" arena to improve respawn flow",
        "- Rebalanced Crystal Crawlers (reduced health and fixed respawn delay)",
        "- Adjusted Spear Guard knockback distance",
        "- Added an additional Patrolling Shroom enemy",
        "- Fixed a bug where standing below gold could push the player into the tilemap",
        "- Adjusted bounce height for one of the mushrooms",
        "- Updated an overlooked area with additional sprites and tiles for improved visuals"
      ]
    },
    {
      "id": "aknightsleapoffaith-v1.0.0",
      "title": "A Knights Leap of Faith",
      "date": "2026-02-09",
      "tag": "New Game",
      "body": [
        "Pain"
      ]
    },
    {
      "id": "slimeimpact2d-v3.0.0",
      "title": "Slime Impact",
      "date": "2026-02-08",
      "tag": "Major Update",
      "body": [
        "Slime Impact 2D — Version 3.0.0 Update!",
        "New Features",
        "- Pyro Metre",
        "- Flame Ability",
        "- Heal Ability",
        "- Player Dashing",
        "- Stamina system",
        "- Custom Cursor",
        "- FULL controller support",
        "- Skip through dialogue option",
        "- Respawn invincibility",
        "- Visual damage feedback on player",
        "‎ ",
        "Changes / Bug Fixes",
        "- Scientist buffs",
        "- Lucifer buffs and nerfs",
        "- Red Riot buffs",
        "- Camera changes",
        "- Ifa text now scales correctly",
        "- Trigger hitbox changes",
        "- Player no longer dies when Ifa dies due to Geo Shield",
        "- Ghost Bomb now explodes when touching certain objects",
        "- Scientist roll hitbox fixed",
        "- Mouse no longer locks after going to the menu",
        "- Anemo burst now boosts the player horizontally",
        "- Spikes move slower",
        "- Ending now works correctly",
        "- Ghost Bomb now affects Lucifer and minions",
        "- Geo Shield visual layer fixed",
        "- Slime King no longer gets stuck on cage",
        "- Scientist animation pixel issues fixed",
        "- Door trigger sound spam fixed",
        "- Attack hitboxes no longer trigger unintended objects",
        "- Ground check fixed",
        "- Screen no longer goes black after Nod-Krai teleport",
        "- Scientist music now stops correctly",
        "- Added fade into ocean",
        "- Options menu no longer appears behind UI",
        "- Mission text from dialogue no longer appears oversized"
      ]
    }
  ]
}
